STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Demonstrations/DemoUCPD/Src/demo_application.c
/**
  ******************************************************************************
  * @file    demo_application.c
  * @author  MCD Application Team
  * @brief   demo application code
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "usbpd_core.h"
#include "usbpd_dpm_core.h"
#include "usbpd_dpm_conf.h"
#include "usbpd_dpm_user.h"
#include "usbpd_pwr_if.h"
#include "stm32g081b_eval.h"
#include "stm32g081b_eval_lcd.h"
#include "stm32g081b_eval_mux.h"
#include "stm32g081b_eval_pwr.h"
#include "logo_STM32_G0.h"
#include "demo_application.h"
#include "string.h"
#include "cmsis_os.h"

/* Exported variables --------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define LCD_ALARMBOX_MESSAGES_MAX         30u

/* Format of the different kind of message */
/*   - 31-28  4 bit for the message type   */
#define DEMO_MSG_TYPE_POS                 28u
#define DEMO_MSG_TYPE_MSK                 (0xFu << DEMO_MSG_TYPE_POS)
#define DEMO_MSG_MMI                      (0u   << DEMO_MSG_TYPE_POS)
#define DEMO_MSG_CAD                      (1u   << DEMO_MSG_TYPE_POS)
#define DEMO_MSG_PENOTIFY                 (2u   << DEMO_MSG_TYPE_POS)

/*  MMI
     - 15-0 id event
#define DEMO_MMI_ACTION_Pos                   (0U)
#define DEMO_MMI_ACTION_Msk                   (0xFF << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION                       DPM_USER_ACTION_Msk
#define DEMO_MMI_ACTION_NONE                  (0u)
#define DEMO_MMI_ACTION_TAMPER_PRESS          (1u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_RIGHT_PRESS           (2u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_LEFT_PRESS            (3u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_UP_PRESS              (4u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_DOWN_PRESS            (5u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_SEL_PRESS             (6u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_HPD_DETECT_HIGH_PORT1 (7u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_HPD_DETECT_LOW_PORT1  (8u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_DISPLAY_VBUS_IBUS     (9u << DEMO_MMI_ACTION_Pos)
#define DEMO_MMI_ACTION_JOY_PRESS             (10u << DEMO_MMI_ACTION_Pos)
*/
/*  CAD
     - 27-26 2 bit for CC Pin
     - 25-24 2 bit port num
     - 15-00 16 bit CAD event
*/
#define DEMO_CAD_CC_NUM_Pos               (26u)
#define DEMO_CAD_CC_NUM_Msk               (0x3u << DEMO_CAD_CC_NUM_Pos)
#define DEMO_CAD_CC_NUM_NONE              (0u   << DEMO_CAD_CC_NUM_Pos)
#define DEMO_CAD_CC_NUM_CC1               (1u   << DEMO_CAD_CC_NUM_Pos)
#define DEMO_CAD_CC_NUM_CC2               (2u   << DEMO_CAD_CC_NUM_Pos)

#define DEMO_CAD_PORT_NUM_Pos             (24u)
#define DEMO_CAD_PORT_NUM_Msk             (0x3u << DEMO_CAD_PORT_NUM_Pos)
#define DEMO_CAD_PORT_NUM_0               (0x0u << DEMO_CAD_PORT_NUM_Pos)
#define DEMO_CAD_PORT_NUM_1               (0x1u << DEMO_CAD_PORT_NUM_Pos)

#define DEMO_CAD_STATE_Pos                (0u)
#define DEMO_CAD_STATE_Msk                (0xFFu << DEMO_CAD_STATE_Pos)

/*  PE
     - 27-26 2 bit none
     - 25-24 2 bit port num
     - 15-00 16 bit PE event
*/
#define DEMO_PE_PORT_NUM_Pos             (24u)
#define DEMO_PE_PORT_NUM_Msk             (0x3u << DEMO_PE_PORT_NUM_Pos)
#define DEMO_PE_PORT_NUM_0               (0x0u << DEMO_PE_PORT_NUM_Pos)
#define DEMO_PE_PORT_NUM_1               (0x1u << DEMO_PE_PORT_NUM_Pos)

#define DEMO_PE_STATE_Pos                (0u)
#define DEMO_PE_STATE_Msk                (0xFFu << DEMO_PE_STATE_Pos)

#define MAX_LINE_PDO      4u
#define MAX_LINE_COMMAND  4u
#define MAX_LINE_EXTCAPA  5u


typedef enum {
  MENU_EMPTY,
  MENU_COMMAND,
  MENU_SOURCECAPA_RECEIVED,
  MENU_SINKCAPA_RECEIVED,
  MENU_EXTCAPA_RECEIVED,
  MENU_BUILD,
  MENU_CABLE,
  MENU_MAX
} DEMO_MENU;

typedef enum {
  COMMAND_NONE,
  COMMAND_HARDRESET,
  COMMAND_CONTROLMSG_GOTOMIN,
  COMMAND_CONTROLMSG_GET_SRC_CAP,
  COMMAND_CONTROLMSG_GET_SNK_CAP,
  COMMAND_CONTROLMSG_DR_SWAP,
  COMMAND_CONTROLMSG_PR_SWAP,
  COMMAND_CONTROLMSG_VCONN_SWAP,
  COMMAND_CONTROLMSG_SOFT_RESET,
  COMMAND_CONTROLMSG_GET_SRC_CAPEXT,
  COMMAND_CONTROLMSG_GET_STATUS,
} DEMO_COMMAND;

enum {
  COMMANDROLE_SRC   = 1,
  COMMANDROLE_SNK   = 2,
  COMMANDROLE_DRP   = 4,
  COMMANDROLE_VCONN = 8
};

typedef struct
{
  uint8_t commandid;
  uint8_t commandstr[23];
  uint8_t commandconfig;
} typedef_COMMANDE;

/* Private macro -------------------------------------------------------------*/
#define DEMO_MAX_COMMAND  12u

/* Private variables ---------------------------------------------------------*/
typedef_COMMANDE g_tab_command_global[DEMO_MAX_COMMAND] = {
  { COMMAND_HARDRESET                   ,"HARD RESET         ", COMMANDROLE_SRC | COMMANDROLE_SNK  },
  { COMMAND_CONTROLMSG_GOTOMIN          ,"GOTO MIN           ", COMMANDROLE_SRC },
  { COMMAND_CONTROLMSG_GET_SRC_CAP      ,"GET SOURCE CAPA    ", COMMANDROLE_SRC | COMMANDROLE_DRP  },
  { COMMAND_CONTROLMSG_GET_SNK_CAP      ,"GET SINK   CAPA    ", COMMANDROLE_SRC },
  { COMMAND_CONTROLMSG_DR_SWAP          ,"DATA ROLE SWAP     ", COMMANDROLE_SRC | COMMANDROLE_SNK  },
  { COMMAND_CONTROLMSG_PR_SWAP          ,"POWER ROLE SWAP    ", COMMANDROLE_DRP },
  { COMMAND_CONTROLMSG_VCONN_SWAP       ,"VCONN SWAP         ", COMMANDROLE_VCONN },
  { COMMAND_CONTROLMSG_SOFT_RESET       ,"SOFT RESET         ", COMMANDROLE_SRC | COMMANDROLE_SNK },
  { COMMAND_CONTROLMSG_GET_SRC_CAPEXT   ,"GET SOURCE EXT CAPA", COMMANDROLE_SNK },
  { COMMAND_CONTROLMSG_GET_STATUS       ,"GET_STATUS         ", 0               },
  { COMMAND_NONE                        ,""                   , 0}
};

