STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Demonstrations/DemoUCPD/Src/demo_application.c
DEMO_MENU g_tab_menu_next[2][MENU_MAX] = {

  { MENU_EMPTY,  MENU_SOURCECAPA_RECEIVED, MENU_SINKCAPA_RECEIVED, MENU_EXTCAPA_RECEIVED, MENU_CABLE, MENU_COMMAND, MENU_BUILD },
  { MENU_EMPTY,  MENU_SOURCECAPA_RECEIVED, MENU_EXTCAPA_RECEIVED,  MENU_EMPTY,            MENU_BUILD, MENU_COMMAND, MENU_EMPTY }
};

DEMO_MENU g_tab_menu_prev[2][MENU_MAX] = {
  { MENU_EMPTY, MENU_BUILD, MENU_COMMAND, MENU_SOURCECAPA_RECEIVED, MENU_SINKCAPA_RECEIVED,   MENU_CABLE,            MENU_EXTCAPA_RECEIVED},
  { MENU_EMPTY, MENU_BUILD, MENU_COMMAND, MENU_EMPTY,               MENU_SOURCECAPA_RECEIVED, MENU_EXTCAPA_RECEIVED, MENU_EMPTY }
};

static typedef_COMMANDE g_tab_command_PORT[2][DEMO_MAX_COMMAND];

/*  contains the id of the selected item inside a menu*/
static uint8_t   g_tab_menu_sel[2] = { 0, 0};
/*  contains the menu selected position  */
static  int8_t   g_tab_menu_pos[2] = { 0, 0};

/* avoid multiple joystick event */
static uint8_t joyevent = 0;

/* Private variables ---------------------------------------------------------*/

/* Counter for Sel Joystick pressed*/
osMessageQId  LCDMsgBox;
static int8_t portSel =0;
USBPD_DiscoveryIdentity_TypeDef pIdentity;

/* Private function prototypes -----------------------------------------------*/
static void Display_Selected_port(void);
static void Display_border(void);
static void Display_clear_info(void);
static void Display_debug_port(uint8_t PortNum, uint8_t *msg);

static void Display_sinkcapa_menu(uint8_t PortNum);
static void Display_sinkcapa_menu_nav(uint8_t PortNum, int8_t Or);

static void Display_sourcecapa_menu_nav(uint8_t PortNum, int8_t Or);
static uint8_t  Display_sourcecapa_menu_exec(uint8_t PortNum);

static void Display_extcapa_menu_nav(uint8_t PortNum, int8_t Or);

static void Display_command_menu(uint8_t PortNum);
static void Display_command_menu_nav(uint8_t PortNum, int8_t Or);
static void Display_command_menu_exec(uint8_t PortNum);

static void Display_cableinfo_menu(uint8_t PortNum);

void DEMO_Task(void const *argument);
static void string_completion(uint8_t *Str, uint8_t SizeMax);

/**
  * @brief  Demo BSP initialisation
  * @param  None
  * @retval None
  */
DEMO_ErrorCode DEMO_InitBSP(void)
{
  BSP_JOY_Init(JOY_MODE_EXTI);
  BSP_PB_Init(BUTTON_TAMPER,BUTTON_MODE_EXTI);

  /*##-1- Initialize the LCD #################################################*/
  /* Initialize the LCD */
  BSP_LCD_Init();
  BSP_LCD_SetFont(&Font12);

  /* Clear the LCD */
  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
  BSP_LCD_Clear(LCD_COLOR_WHITE);

  BSP_LCD_DrawBitmap(0, 0, (uint8_t *)header_data_logo);

    /* Protection against bad compilation configuration */
  if (BSP_PWR_DCDCGetCtrlMode(0) == DCDC_CTRL_MODE_GPIO)
  {
       BSP_LCD_SetFont(&Font16);
       BSP_LCD_SetTextColor(LCD_COLOR_RED);
       BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
       BSP_LCD_DisplayStringAt(0, 1 + (6 * Font16.Height), (uint8_t*)"Power configuration incorrect", CENTER_MODE);

       BSP_LCD_DisplayStringAt(0, 1 + (7 * Font16.Height), (uint8_t*)"PWM mode in firmware", CENTER_MODE);
       BSP_LCD_DisplayStringAt(0, 1 + (8 * Font16.Height), (uint8_t*)"but board is in GPIO mode", CENTER_MODE);
       while(1);
  }
  else if (BSP_PWR_DCDCGetCtrlMode(0) == DCDC_CTRL_MODE_UNKNOWN)
  {
       BSP_LCD_SetFont(&Font16);
       BSP_LCD_SetTextColor(LCD_COLOR_RED);
       BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
       BSP_LCD_DisplayStringAt(0, 1 + (6 * Font16.Height), (uint8_t*)"Board configuration unknown", CENTER_MODE);
  }

  Display_Selected_port();
  Display_border();

 return DEMO_OK;
}

DEMO_ErrorCode DEMO_InitTask()
{
  osMessageQDef(MsgBox, LCD_ALARMBOX_MESSAGES_MAX, uint32_t);
  osThreadDef(LCD, DEMO_Task, osPriorityLow, 0, 280);

  LCDMsgBox = osMessageCreate(osMessageQ(MsgBox), NULL);
  if(NULL == osThreadCreate(osThread(LCD), &LCDMsgBox))
  {
    return DEMO_ERROR;
  }

  return DEMO_OK;
}

/**
  * @brief  UserCableDetection reporting events on a specified port from CAD layer.
  * @param  PortNum The handle of the port
  * @param  State CAD state
  * @param  Cc  The Communication Channel for the USBPD communication
  * @retval None
  */
void DEMO_PostCADMessage(uint8_t PortNum, USBPD_CAD_EVENT State, CCxPin_TypeDef Cc)
{
  uint32_t event = (DEMO_MSG_CAD |  (Cc << DEMO_CAD_CC_NUM_Pos | (PortNum << DEMO_CAD_PORT_NUM_Pos) | State ));
  osMessagePut(LCDMsgBox, event, 0);
}

/**
  * @brief  Callback function called by PE to inform DPM about PE event.
  * @param  PortNum The handle of the port
  * @param  EventVal @ref USBPD_NotifyEventValue_TypeDef
  * @retval None
  */
void DEMO_PostNotificationMessage(uint8_t PortNum, USBPD_NotifyEventValue_TypeDef EventVal)
{
  uint32_t event = DEMO_MSG_PENOTIFY | PortNum << DEMO_PE_PORT_NUM_Pos | EventVal;
  osMessagePut(LCDMsgBox, event, 0);
}


/**
  * @brief  Callback function called by PE to inform DPM about PE event.
  * @param  EventVal @ref USBPD_NotifyEventValue_TypeDef
  * @retval None
  */
void DEMO_PostMMIMessage(uint32_t EventVal)
{
  uint32_t event = DEMO_MSG_MMI | EventVal;
  if (joyevent == 0 ) {
    if(osMessagePut(LCDMsgBox, event, 0) != osErrorOS) joyevent = 1;
  }
}

/**
  * @brief  Function used to save cable information .
  * @param  PortNum The handle of the port
  * @param  pDiscoIdentify Pointer on the VDM discovery identify
  * @retval None
  */
void DEMO_SetCableInfo(uint8_t PortNum, USBPD_DiscoveryIdentity_TypeDef *pDiscoIdentify)
{
  memcpy(&pIdentity, pDiscoIdentify, sizeof(USBPD_DiscoveryIdentity_TypeDef));
}

void HAL_GPIO_EXTI_Rising_Callback(uint16_t GPIO_Pin)
{
  if(GPIO_Pin == DET_HPD_SOURCE_PIN)
  {
    BSP_MUX_Detect_HPD();
  }

  if (GPIO_Pin == LEFT_JOY_PIN)
  {
    DEMO_PostMMIMessage(DEMO_MMI_ACTION_LEFT_PRESS);
  }
  if (GPIO_Pin == RIGHT_JOY_PIN)
  {
    DEMO_PostMMIMessage(DEMO_MMI_ACTION_RIGHT_PRESS);
  }
  if (GPIO_Pin == DOWN_JOY_PIN)
  {
    DEMO_PostMMIMessage(DEMO_MMI_ACTION_DOWN_PRESS);
  }
  if (GPIO_Pin == UP_JOY_PIN)
  {
    DEMO_PostMMIMessage(DEMO_MMI_ACTION_UP_PRESS);
  }
  if (GPIO_Pin == SEL_JOY_PIN)
  {
    DEMO_PostMMIMessage(DEMO_MMI_ACTION_SEL_PRESS);
  }
}

void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin)
{
  if(GPIO_Pin == DET_HPD_SOURCE_PIN)
  {
    BSP_MUX_Detect_HPD();
  }

 if ((GPIO_Pin == TAMPER_BUTTON_PIN) || (GPIO_Pin == SEL_JOY_PIN))
  {
    DEMO_PostMMIMessage(DEMO_MMI_ACTION_TAMPER_PRESS);
  }
}


/**
  * @brief  Display power
  * @retval None
  */
static void Display_power(void)
{
  uint32_t vsense = 0;
  int32_t isense = 0;
  char  pstr[20]={0};
  static uint8_t counter = 0;

  counter++;

  if(counter == 5)
  {
    counter = 0;

