STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Demonstrations/DemoUCPD/Src/demo_application.c
    BSP_LCD_SetFont(&Font12);
    BSP_LCD_SetTextColor(LCD_COLOR_ST_PINK);
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);

    /* Port 0 */
    if(DPM_Ports[USBPD_PORT_0].DPM_IsConnected)
    {
      vsense = BSP_PWR_VBUSGetVoltage(USBPD_PORT_0);
      isense = BSP_PWR_VBUSGetCurrent(USBPD_PORT_0);
      if(isense < 0)
      {
        isense = -isense;
        sprintf(pstr,"%2d.%0.2dV -%1d.%0.2dA",(vsense / 1000), (vsense % 1000)/10, (isense/1000), (isense % 1000)/10);
      }
      else
      {
        sprintf(pstr,"%2d.%0.2dV %1d.%0.2dA",(vsense / 1000), (vsense % 1000)/10, (isense/1000), (isense % 1000)/10);
      }

      if(USBPD_TRUE == DPM_Params[USBPD_PORT_0].VconnStatus)
      {
        sprintf(pstr, "%s VC ", pstr);
      }
      else
      {
        sprintf(pstr, "%s     ", pstr);
      }

      BSP_LCD_DisplayStringAt(57, Font12.Height * 4, (uint8_t*)pstr,LEFT_MODE);
    }
    else
    {
      BSP_LCD_DisplayStringAt(57, Font12.Height * 4, (uint8_t*)"                 ",LEFT_MODE);
    }

#if (USBPD_PORT_COUNT > 1)
    /* Port 1 */
    if(DPM_Ports[USBPD_PORT_1].DPM_IsConnected)
    {
      vsense = BSP_PWR_VBUSGetVoltage(USBPD_PORT_1);
      isense = BSP_PWR_VBUSGetCurrent(USBPD_PORT_1);
      if(isense < 0)
      {
        isense = -isense;
        sprintf(pstr,"%2d.%0.2dV -%1d.%0.2dA",(vsense / 1000), (vsense % 1000)/10, (isense/1000), (isense % 1000)/10);
      }
      else
      {
        sprintf(pstr,"%2d.%0.2dV %1d.%0.2dA",(vsense / 1000), (vsense % 1000)/10, (isense/1000), (isense % 1000)/10);
      }

      if(USBPD_TRUE == DPM_Params[USBPD_PORT_1].VconnStatus)
      {
        sprintf(pstr, "%s VC ", pstr);
      }
      else
      {
        sprintf(pstr, "%s     ", pstr);
      }

      BSP_LCD_DisplayStringAt(185, Font12.Height * 4, (uint8_t*)pstr, LEFT_MODE);
    }
    else
    {
      BSP_LCD_DisplayStringAt(185, Font12.Height * 4, (uint8_t*)"                 ",LEFT_MODE);
    }
#endif
  }
}

/**
  * @brief  Display contract info
  * @param  PortNum The handle of the port
  * @retval None
  */
static void Display_contract_port(uint8_t PortNum)
{
  uint32_t pos;

  BSP_LCD_SetFont(&Font16);
  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
  BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_DARK);

  pos = (PortNum == 0)? 54:181;
  pos = pos +  Font16.Width;

  /* PDX */
  if(DPM_Ports[PortNum].DPM_IsConnected)
  {
    if (USBPD_SPECIFICATION_REV3 == DPM_Params[PortNum].PE_SpecRevision)
    {
      BSP_LCD_DisplayStringAt(pos, 10+ Font16.Height, (uint8_t*)"PD3", LEFT_MODE);
    }
    else
    {
      BSP_LCD_DisplayStringAt(pos, 10+Font16.Height, (uint8_t*)"PD2", LEFT_MODE);
    }

    /* UFP/DFP */
    if (USBPD_PORTDATAROLE_UFP == DPM_Params[PortNum].PE_DataRole)
    {
      BSP_LCD_DisplayStringAt(pos + 38, 10+ Font16.Height, (uint8_t*)"UFP", LEFT_MODE);
    }
    else
    {
      BSP_LCD_DisplayStringAt(pos + 38, 10 + Font16.Height, (uint8_t*)"DFP", LEFT_MODE);
    }

  }
  else
  {
    BSP_LCD_DisplayStringAt(pos, 10+Font16.Height, (uint8_t*)"          ", LEFT_MODE);
  }
}

/**
  * @brief  Display hpd
  * @param  PortNum The handle of the port
  * @param  status  HPD status
  * @retval None
  */
static void Display_hpd(uint8_t PortNum, uint8_t status)
{
  uint32_t pos;

  BSP_LCD_SetFont(&Font16);
  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
  BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_DARK);

  pos = (PortNum == 0)? 54+85:181+85;

  /* HPD info */
  if(status == USBPD_TRUE)
  {
    BSP_LCD_DisplayStringAt(pos, 10, (uint8_t*)"HPD", LEFT_MODE);
  }
  else
  {
    BSP_LCD_DisplayStringAt(pos, 10, (uint8_t*)"   ", LEFT_MODE);
  }
}

/**
  * @brief  Display error message
  * @param  PortNum The handle of the port
  * @retval None
  */
void DEMO_Display_Error(uint8_t PortNum)
{
  Display_clear_info();

  BSP_LCD_SetFont(&Font16);
  BSP_LCD_SetBackColor(LCD_COLOR_RED);
  BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_LIGHT);

  /* Display error info */
  BSP_LCD_DisplayStringAt(0, 1 + 6 * Font16.Height, (uint8_t *)"  POWER SUPPLY ERROR  ", CENTER_MODE);
}

/**
  * @brief  Display CC info
  * @param  PortNum The handle of the port
  * @param  cc      CC Pin value
  * @retval None
  */
static void Display_cc_port(uint8_t PortNum, CCxPin_TypeDef cc)
{
  uint32_t pos;

  BSP_LCD_SetFont(&Font16);
  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
  BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_DARK);

  pos = (PortNum == 0)? 54+30:181+30;
  pos = pos +  5*Font16.Width;

  switch(cc)
  {
  case CCNONE :
    BSP_LCD_DisplayStringAt(pos, 10+ Font16.Height, (uint8_t*)"    ", LEFT_MODE);
    break;
  case CC1 :
    BSP_LCD_DisplayStringAt(pos, 10+ Font16.Height, (uint8_t*)"CC1", LEFT_MODE);
    break;
  case CC2 :
    BSP_LCD_DisplayStringAt(pos, 10+ Font16.Height, (uint8_t*)"CC2", LEFT_MODE);
    break;
  }
}

/**
  * @brief  Display border
  * @retval None
  */
static void Display_border(void)
{
  BSP_LCD_SetBackColor(LCD_COLOR_CYAN);
  BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_DARK);

  BSP_LCD_DrawLine(0, 5 * Font12.Height, 320, 5 * Font12.Height);
  BSP_LCD_DrawLine(0, 16 * Font12.Height -1 , 320, 16 * Font12.Height - 1);
  BSP_LCD_DrawLine(160, 16 * Font12.Height - 1,  160, 240);
}

/**
  * @brief  Display clear info
  * @retval None
  */
static void Display_clear_info(void)
{
  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
  BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
  BSP_LCD_SetFont(&Font12);

  /* Fill a blank rectangle to clear the display information panel */
  BSP_LCD_FillRect(0, LINE(6), 320, 9*Font12.Height);
}

/**
  * @brief  Display build info
  * @retval None
  */
static void Display_build_info(void)
{
  uint8_t _str[16];
  memset(_str, 0, sizeof(_str));

  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
  BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_DARK);
  BSP_LCD_SetFont(&Font16);

  BSP_LCD_DisplayStringAt(0, 1 + (5 * Font16.Height), (uint8_t*)"BSP built for", CENTER_MODE);
  BSP_LCD_DisplayStringAt(0, 1 + (6 * Font16.Height), (uint8_t*)"STM32G081B-EVAL", CENTER_MODE);
  sprintf((char *)_str,"REV C");
  sprintf((char *)_str,"%s - PWM",_str);
  BSP_LCD_DisplayStringAt(0,1 + (7 * Font16.Height), _str, CENTER_MODE);

  _str[0] = 0;
#if defined(_GUI_INTERFACE)
  sprintf((char *)_str,"GUI");
#endif
#if defined(_TRACE)
  sprintf((char *)_str,"%s TRACE", _str);
#endif
  sprintf((char *)_str,"%s PPS", _str);

  BSP_LCD_DisplayStringAt(0,1 + (8 * Font16.Height), _str, CENTER_MODE);

