STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Demonstrations/DemoUCPD/Src/demo_application.c
  BSP_LCD_SetFont(&Font12);
  sprintf((char *)str, "UNCK  DRD  USB  EPW  SUSP  DRP ");
  if( DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[0] & USBPD_PDO_SRC_FIXED_UNCHUNK_SUPPORT_Msk)       str[4] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[0] & USBPD_PDO_SRC_FIXED_DRD_SUPPORT_Msk)           str[9] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[0] & USBPD_PDO_SRC_FIXED_USBCOMM_Msk)               str[14] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[0] & USBPD_PDO_SRC_FIXED_EXT_POWER_Msk)             str[19] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[0] & USBPD_PDO_SRC_FIXED_USBSUSPEND_Msk)            str[25] = '*';
  if( DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[0] & USBPD_PDO_SRC_FIXED_DRP_SUPPORT_Msk)           str[30] = '*';
  BSP_LCD_DisplayStringAt(0, 1 + 6 * Font12.Height + Font16.Height , str, LEFT_MODE);

  Display_sourcecapa_menu_nav(PortNum, 0);
}

/**
  * @brief  src capa menu navigation
  * @param  PortNum     The handle of the port
  * @param  Nav         Navigation
  * @retval None
  */
static void Display_sourcecapa_menu_nav(uint8_t PortNum, int8_t Nav)
{
  uint8_t _str[25];
  uint8_t _max = DPM_Ports[portSel].DPM_NumberOfRcvSRCPDO;
  uint8_t _start, _end;

  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
  BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_DARK);
  BSP_LCD_SetFont(&Font16);

  Menu_manage_selection(PortNum, _max, MAX_LINE_PDO, &_start, &_end, Nav);

  for(int8_t index=_start; index < _end; index++)
  {
    switch((DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_TYPE_Msk) >> USBPD_PDO_TYPE_Pos)
    {
    case USBPD_CORE_PDO_TYPE_FIXED :
      {
        uint32_t maxcurrent = ((DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_FIXED_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_FIXED_MAX_CURRENT_Pos)*10;
        uint32_t maxvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_FIXED_VOLTAGE_Msk) >> USBPD_PDO_SRC_FIXED_VOLTAGE_Pos)*50;
        sprintf((char*)_str, " FIXED:%2dV %2d.%dA ", (maxvoltage/1000), (maxcurrent/1000), ((maxcurrent % 1000) /100));
      }
      break;
    case USBPD_CORE_PDO_TYPE_BATTERY :
      {
        uint32_t maxvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_BATTERY_MAX_VOLTAGE_Msk) >> USBPD_PDO_SRC_BATTERY_MAX_VOLTAGE_Pos) * 50;
        uint32_t minvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_BATTERY_MIN_VOLTAGE_Msk) >> USBPD_PDO_SRC_BATTERY_MIN_VOLTAGE_Pos) * 50;
        uint32_t maxpower = ((DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_BATTERY_MAX_POWER_Msk) >> USBPD_PDO_SRC_BATTERY_MAX_POWER_Pos) * 250;
        sprintf((char*)_str, " BATT:%2d.%1d-%2d.%1dV %2d.%dW", (minvoltage/1000),(minvoltage/100)%10, (maxvoltage/1000),(maxvoltage/100)%10, (maxpower/1000), (maxpower%1000)/100);
      }
      break;
    case USBPD_CORE_PDO_TYPE_VARIABLE :
      {
        uint32_t maxvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_VARIABLE_MAX_VOLTAGE_Msk) >> USBPD_PDO_SRC_VARIABLE_MAX_VOLTAGE_Pos) * 50;
        uint32_t minvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_VARIABLE_MIN_VOLTAGE_Msk) >> USBPD_PDO_SRC_VARIABLE_MIN_VOLTAGE_Pos) * 50;
        uint32_t maxcurrent = ((DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_VARIABLE_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_VARIABLE_MAX_CURRENT_Pos) * 10;
        sprintf((char*)_str, " VAR: %2d.%1d-%2d.%1dV %2d.%dA", (minvoltage/1000),(minvoltage/100)%10, (maxvoltage/1000),(maxvoltage/100)%10, (maxcurrent/1000), ((maxcurrent % 1000) /100));
      }
      break;
    case USBPD_CORE_PDO_TYPE_APDO :
      {
        uint32_t minvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_APDO_MIN_VOLTAGE_Msk) >> USBPD_PDO_SRC_APDO_MIN_VOLTAGE_Pos) * 100;
        uint32_t maxvoltage = ((DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_APDO_MAX_VOLTAGE_Msk) >> USBPD_PDO_SRC_APDO_MAX_VOLTAGE_Pos) * 100;
        uint32_t maxcurrent = ((DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_APDO_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_APDO_MAX_CURRENT_Pos) * 50;
        sprintf((char*)_str, " APDO:%2d.%1d-%2d.%1dV %2d.%dA", (minvoltage/1000),(minvoltage/100)%10, (maxvoltage/1000),(maxvoltage/100)%10, (maxcurrent/1000), ((maxcurrent % 1000) /100));
      }
      break;
    default :
      sprintf((char*)_str,"Not yet managed by demo");
      break;
    }
    string_completion(_str, sizeof(_str));

    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      BSP_LCD_SetBackColor(LCD_COLOR_ST_PINK);
      BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
    }

    BSP_LCD_DisplayStringAt(Font12.Width * 2, 1 + 8 * Font12.Height  + (index + 1 - _start) * Font16.Height,  (uint8_t*)_str, LEFT_MODE);

    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
      BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_DARK);
    }
  }
}

/**
  * @brief  src capa menu exec
  * @param  PortNum     The handle of the port
  * @retval None
  */
uint8_t Display_sourcecapa_menu_exec(uint8_t PortNum)
{
  USBPD_SNKRDO_TypeDef rdo;
  USBPD_PDO_TypeDef  pdo;
  USBPD_PDO_TypeDef fixed_pdo;
  uint32_t voltage, allowablepower, size;
  uint32_t snkpdolist[USBPD_MAX_NB_PDO];
  USBPD_PDO_TypeDef snk_fixed_pdo;
  static uint8_t indexAPDO = 0;
  
  /* Read SNK PDO list for retrieving useful data to fill in RDO */
  USBPD_PWR_IF_GetPortPDOs(PortNum, USBPD_CORE_DATATYPE_SNK_PDO, (uint8_t*)&snkpdolist[0], &size);
  /* Store value of 1st SNK PDO (Fixed) in local variable */
  snk_fixed_pdo.d32 = snkpdolist[0];
  
  /* selected SRC PDO */
  pdo.d32 = DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[g_tab_menu_sel[PortNum]];
  switch(pdo.GenericPDO.PowerObject)
  {
  case USBPD_CORE_PDO_TYPE_APDO :
    voltage = 4500;
    allowablepower = 4500;
    break;
  default:
    voltage = 0;
    allowablepower = 0;
    break;
  }

  /* check if the selected source PDO is matching any of the SNK PDO */
  if (USBPD_TRUE == USBPD_DPM_SNK_EvaluateMatchWithSRCPDO(PortNum, pdo.d32, &voltage, &allowablepower))
  {
    /* consider the current PDO as correct */
  }
  else
  {
    Display_debug_port(PortNum, (uint8_t *)"Invalid PDO for SINK");
    return(1); /* error */
  }
  if (USBPD_CORE_PDO_TYPE_APDO == pdo.GenericPDO.PowerObject)
  {
    rdo.d32 = 0;
    rdo.ProgRDO.CapabilityMismatch = 0;
    rdo.ProgRDO.NoUSBSuspend = 0;
    rdo.ProgRDO.OperatingCurrentIn50mAunits = 1500 /50;
    rdo.ProgRDO.OutputVoltageIn20mV = (3600 + (indexAPDO * 100)) /20;
    indexAPDO++;
    if (indexAPDO > 14) indexAPDO = 0;
    rdo.FixedVariableRDO.ObjectPosition = g_tab_menu_sel[PortNum] + 1;
    USBPD_PE_Send_Request(PortNum, rdo.d32, USBPD_CORE_PDO_TYPE_APDO);

