STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Demonstrations/DemoUCPD/Src/demo_application.c
    char _str[20];
    sprintf(_str,"request ADPO:%d",rdo.ProgRDO.OutputVoltageIn20mV * 20);
    Display_debug_port(PortNum, (uint8_t *)_str);
  }
  else
  {
    rdo.d32 = 0;
    rdo.FixedVariableRDO.CapabilityMismatch = 0;
    rdo.FixedVariableRDO.GiveBackFlag = 0;
    rdo.FixedVariableRDO.MaxOperatingCurrent10mAunits = ((DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[g_tab_menu_sel[PortNum]] & USBPD_PDO_SRC_FIXED_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_FIXED_MAX_CURRENT_Pos);
    rdo.FixedVariableRDO.NoUSBSuspend = 0;
    rdo.FixedVariableRDO.ObjectPosition = g_tab_menu_sel[PortNum] + 1;
    rdo.FixedVariableRDO.USBCommunicationsCapable = snk_fixed_pdo.SNKFixedPDO.USBCommunicationsCapable;
    if (USBPD_SPECIFICATION_REV2 < DPM_Params[PortNum].PE_SpecRevision)
    {
      rdo.FixedVariableRDO.UnchunkedExtendedMessage = DPM_Settings[PortNum].PE_PD3_Support.d.PE_UnchunkSupport;
      fixed_pdo.d32 = DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[0];
      DPM_Params[PortNum].PE_UnchunkSupport   = USBPD_FALSE;
      /* Set unchuncked bit if supported by port partner;*/
      if (USBPD_TRUE == fixed_pdo.SRCFixedPDO.UnchunkedExtendedMessage)
      {
        DPM_Params[PortNum].PE_UnchunkSupport   = USBPD_TRUE;
      }
    }

    if ((DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[g_tab_menu_sel[PortNum]] & USBPD_PDO_TYPE_Msk) == USBPD_PDO_TYPE_FIXED)
    {
      if( USBPD_OK == USBPD_DPM_RequestMessageRequest(PortNum, rdo.GenericRDO.ObjectPosition, voltage))
      {
        Display_debug_port(PortNum, (uint8_t *)"request sent");
        return(0); /* ok */
      }
      else
      {
        Display_debug_port(PortNum, (uint8_t *)"request not sent");
      }
    }
    else
    {
      Display_debug_port(PortNum, (uint8_t *)"not supported by demo");
    }
  }
  return 1;
}

/**
  * @brief  ext capa menu display
  * @param  PortNum     The handle of the port
  * @retval None
  */
static void Display_extcapa_menu(uint8_t PortNum)
{
  uint8_t str[30];

  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
  BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_DARK);
  BSP_LCD_SetFont(&Font16);

  /* Display menu source capa */
  sprintf((char *)str, "Extended capa : ");
  BSP_LCD_DisplayStringAt(0, 1 + 6 * Font12.Height, str, LEFT_MODE);

  Display_extcapa_menu_nav(PortNum, 0);
}

/**
  * @brief  ext capa menu navigation
  * @param  PortNum     The handle of the port
  * @param  Orientation Orientation
  * @retval None
  */
static void Display_extcapa_menu_nav(uint8_t PortNum, int8_t Orientation)
{
  uint8_t _str[16][20];
  uint8_t _max = 16;  /* Nb field inside extended capa */
  uint8_t _start, _end;

  memset(_str, ' ', sizeof(_str));

  sprintf((char *)_str[0], "VID:0x%x",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.VID);
  sprintf((char *)_str[1], "PID:0x%x",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.PID);
  sprintf((char *)_str[2], "XID:0x%x",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.XID);
  sprintf((char *)_str[3], "F rev:0x%x",    DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.FW_revision);
  sprintf((char *)_str[4], "H rev:0x%x",    DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.HW_revision);
  sprintf((char *)_str[5], "V reg:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.Voltage_regulation);
  sprintf((char *)_str[6], "Htime:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.Holdup_time);
  sprintf((char *)_str[7], "Compliance:%d", DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.Compliance);
  sprintf((char *)_str[8], "Tcurre:%d",     DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.TouchCurrent);
  sprintf((char *)_str[9], "Peak1:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.PeakCurrent1);
  sprintf((char *)_str[10],"Peak2:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.PeakCurrent2);
  sprintf((char *)_str[11],"Peak3:%d" ,     DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.PeakCurrent3);
  sprintf((char *)_str[12],"Ttemp:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.Touchtemp);
  sprintf((char *)_str[13],"SRCin:%d",      DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.Source_inputs);
  sprintf((char *)_str[14],"Nbbatt:%d",     DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.NbBatteries);
  sprintf((char *)_str[15],"PDP:%d",        DPM_Ports[PortNum].DPM_RcvSRCExtendedCapa.SourcePDP);

  for(int8_t i = 0; i < _max; i++)
  {
    uint8_t _size = strlen((char *)_str[i]);
    if(_size < 19 )
    {
      _str[i][_size] = ' ';
      _str[i][19] = '\0';
    }
  }

  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
  BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_DARK);
  BSP_LCD_SetFont(&Font16);

  Menu_manage_selection(PortNum, _max, MAX_LINE_EXTCAPA, &_start, &_end, Orientation);

  for(int8_t index=_start; index < _end; index++)
  {

    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      BSP_LCD_SetBackColor(LCD_COLOR_ST_PINK);
      BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
    }

    BSP_LCD_DisplayStringAt(0, 1 + 6 * Font12.Height  + (index + 1 - _start) * Font16.Height,  (uint8_t*)_str[index], CENTER_MODE);

    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
      BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_DARK);
    }
  }
}

/**
  * @brief  command menu display
  * @param  PortNum     The handle of the port
  * @retval None
  */
static void Display_command_menu(uint8_t PortNum)
{
  uint8_t _config = 0;
  uint8_t _countcommand = 0;

  /* Menu command display */
  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
  BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_DARK);
  BSP_LCD_SetFont(&Font16);

  if(USBPD_PORTPOWERROLE_SRC == DPM_Params[PortNum].PE_PowerRole) { _config = COMMANDROLE_SRC; }
  else { _config = COMMANDROLE_SNK; }
  if(USBPD_TRUE == DPM_Settings[PortNum].PE_RoleSwap ) _config|= COMMANDROLE_DRP;
  if(USBPD_TRUE == DPM_USER_Settings[PortNum].PE_VconnSwap) _config|= COMMANDROLE_VCONN;

  memset(g_tab_command_PORT[PortNum], 0, sizeof(typedef_COMMANDE)*DEMO_MAX_COMMAND);

  for(uint8_t index = 0; index < DEMO_MAX_COMMAND ;index++)
  {
     if(_config & g_tab_command_global[index].commandconfig)
     {
       memcpy((void *)&g_tab_command_PORT[PortNum][_countcommand], &g_tab_command_global[index], sizeof(typedef_COMMANDE));
       _countcommand++;
     }
  }

