STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Demonstrations/DemoUCPD/Src/demo_application.c
  /* Display menu command */
  BSP_LCD_DisplayStringAt(0, 1 + 6 * Font12.Height, (uint8_t *)"Commands :       ", LEFT_MODE);

  Display_command_menu_nav(PortNum, 0);
}

/**
  * @brief  command menu navigation
  * @param  PortNum     The handle of the port
  * @param  Nav         (+1 -1 or 0)
  * @retval None
  */
void Display_command_menu_nav(uint8_t PortNum, int8_t Nav)
{
  uint8_t _max = 0;
  uint8_t _start;
  uint8_t _end;

  /* count the max value */
  for(uint8_t index = 0; index < DEMO_MAX_COMMAND; index++)
  {
     if(COMMAND_NONE != g_tab_command_PORT[PortNum][index].commandid )
     {
       _max++;
     }
  }

  Menu_manage_selection(PortNum, _max, MAX_LINE_COMMAND, &_start, &_end, Nav);

  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
  BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_DARK);
  BSP_LCD_SetFont(&Font16);


  for(int8_t index=_start; index < _end; index++)
  {
    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      BSP_LCD_SetBackColor(LCD_COLOR_ST_PINK);
      BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
    }

    BSP_LCD_DisplayStringAt(0, 1 + 7 * Font12.Height  + (index + 1 - _start) * Font16.Height,  (uint8_t*)g_tab_command_PORT[PortNum][index].commandstr, CENTER_MODE);

    if((index - _start) == g_tab_menu_pos[PortNum])
    {
      BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
      BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_DARK);
    }
  }
}

/**
  * @brief  command menu execution
  * @param  PortNum     The handle of the port
  * @retval None
  */
static void Display_command_menu_exec(uint8_t PortNum)
{
  switch(g_tab_command_PORT[PortNum][g_tab_menu_sel[PortNum]].commandid)
  {
  case COMMAND_HARDRESET :
    USBPD_PE_Request_HardReset(PortNum);
    break;
  case COMMAND_CONTROLMSG_GOTOMIN :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_GOTOMIN, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request gotomin");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  case COMMAND_CONTROLMSG_GET_SRC_CAP :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_GET_SRC_CAP, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request srccapa");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  case COMMAND_CONTROLMSG_GET_SNK_CAP :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_GET_SNK_CAP, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request snkcapa");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  case COMMAND_CONTROLMSG_DR_SWAP :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_DR_SWAP, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request drswap");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  case COMMAND_CONTROLMSG_PR_SWAP :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_PR_SWAP, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request prswap");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  case COMMAND_CONTROLMSG_VCONN_SWAP :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_VCONN_SWAP, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request vconnswap");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  case COMMAND_CONTROLMSG_SOFT_RESET :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_SOFT_RESET, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request swreset");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  case COMMAND_CONTROLMSG_GET_SRC_CAPEXT :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_GET_SRC_CAPEXT, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request extcapa");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  case COMMAND_CONTROLMSG_GET_STATUS :
    if( USBPD_OK == USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_GET_STATUS, USBPD_SOPTYPE_SOP))
      Display_debug_port(PortNum, (uint8_t*)"request status");
    else
      Display_debug_port(PortNum, (uint8_t*)"request not sent");
    break;
  default :
    break;
  }
}

/**
  * @brief  manage menu display
  * @param  PortNum     The handle of the port
  * @param  MenuSel     Selection of the menu
  * @retval None
  */
static void Display_menuupdate_info(uint8_t PortNum, DEMO_MENU MenuSel)
{
  Display_clear_info();
  switch(MenuSel)
  {
  default :
  case MENU_EMPTY : /* No Port connected so nothing to display */
/*    Display_build_info();*/
    break;
  case MENU_COMMAND : /* Display menu command */
    Display_command_menu(PortNum);
    break;
  case MENU_SOURCECAPA_RECEIVED : /* Display menu source capa */
    Display_sourcecapa_menu(PortNum);
    break;
  case MENU_SINKCAPA_RECEIVED : /* Display menu source capa */
    Display_sinkcapa_menu(PortNum);
    break;
  case MENU_BUILD :
    Display_build_info();
    break;
  case MENU_EXTCAPA_RECEIVED :
    Display_extcapa_menu(PortNum);
    break;
  case MENU_CABLE:
    Display_cableinfo_menu(PortNum);
    break;
  }
}

/**
  * @brief  manage menu selection
  * @param  PortNum     The handle of the port
  * @param  MenuSel     Selection of the menu
  * @param  Nav         (+1, -1, 0)
  * @retval None
  */
static void Display_menunav_info(uint8_t PortNum, uint8_t MenuSel, int8_t Nav)
{
  switch(MenuSel)
  {
  default :
  case MENU_EMPTY : /* No Port connected so nothing to display */
    break;
  case MENU_COMMAND : /* Display menu command */
    Display_command_menu_nav(PortNum, Nav);
    break;
  case MENU_SOURCECAPA_RECEIVED : /* Display menu source capa */
    Display_sourcecapa_menu_nav(PortNum, Nav);
    break;
  case MENU_SINKCAPA_RECEIVED : /* Display menu source capa */
    Display_sinkcapa_menu_nav(PortNum, Nav);
    break;
  case MENU_EXTCAPA_RECEIVED : /* Display menu source capa */
    Display_extcapa_menu_nav(PortNum, Nav);
    break;
  }
}

/**
  * @brief  manage menu execution
  * @param  PortNum     The handle of the port
  * @param  MenuSel     Selection of the menu
  * @retval None
  */
static void Display_menuexec_info(uint8_t PortNum, uint8_t MenuSel)
{
  switch(MenuSel)
  {
  default :
  case MENU_EMPTY : /* No Port connected so nothing to display */
    break;
  case MENU_COMMAND : /* Display menu command */
    Display_command_menu_exec(PortNum);
    break;
  case MENU_SOURCECAPA_RECEIVED : /* Display menu source capa */
    Display_sourcecapa_menu_exec(PortNum);
    break;
  }
}

/**
  * @brief  manage the debug port info display
  * @param  PortNum     The handle of the port
  * @param  msg         string to display
  * @retval None
  */
static void Display_debug_port(uint8_t PortNum, uint8_t *msg)
{
  uint32_t pos;
  static uint8_t TxtMessage[2][4][22];

  if (strlen((char*)msg) > 22)
  {
    /* Display not possible */
    sprintf((char*)TxtMessage[PortNum][3], "Display error\n");
    return;
  }

