STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Demonstrations/DemoUCPD/Src/demo_application.c
  BSP_LCD_SetFont(&Font12);
  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
  BSP_LCD_SetTextColor(LCD_COLOR_ST_PURPLE);

  pos = (PortNum == 0)? 0:160;
  pos = pos + 5;

  /* move line 2 inside 1 */
  strncpy((char*)TxtMessage[PortNum][0], (char*)TxtMessage[PortNum][1], 21);
  strncpy((char*)TxtMessage[PortNum][1], (char*)TxtMessage[PortNum][2], 21);
  /* move line 3 inside 2 */
  strncpy((char*)TxtMessage[PortNum][2], (char*)TxtMessage[PortNum][3], 21);
  /* move line enter inside line 3 */
  memset(TxtMessage[PortNum][3], 0, 20*sizeof(uint8_t));
  sprintf((char*)TxtMessage[PortNum][3], "%21s", msg);

  for(uint8_t index = 0; index < 4; index++)
  {
    BSP_LCD_DisplayStringAt(pos, (index + 16) * Font12.Height, TxtMessage[PortNum][index], LEFT_MODE);
  }
}

/**
  * @brief  main demo function to manage all the appplication event and to update MMI
  * @retval None
  */
static void Display_Selected_port(void)
{
  char pstr[20]={0};
  BSP_LCD_SetFont(&Font16);

  if (portSel == 0)
  {
    BSP_LCD_SetBackColor(LCD_COLOR_ST_PINK);
    BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
  }
  else
  {
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
    BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_DARK);
  }

  /* Port 0 */
  if(DPM_Ports[0].DPM_IsConnected)
  {
    if (USBPD_PORTPOWERROLE_SRC == DPM_Params[0].PE_PowerRole)
      BSP_LCD_DisplayStringAt(54 + Font16.Width , 10, (uint8_t*)"P1:SRC", LEFT_MODE);
    else
      BSP_LCD_DisplayStringAt(54 + Font16.Width , 10, (uint8_t*)"P1:SNK", LEFT_MODE);
  }
  else
  {
    if(USBPD_TRUE == DPM_Settings[0].CAD_RoleToggle)
    {
      BSP_LCD_DisplayStringAt(54 + Font16.Width, 10, (uint8_t*)"P1:DRP", LEFT_MODE);
    }
    else
    {
      if (USBPD_PORTPOWERROLE_SRC == DPM_Settings[0].PE_DefaultRole)
        BSP_LCD_DisplayStringAt(54 + Font16.Width , 10, (uint8_t*)"P1:SRC", LEFT_MODE);
      else
        BSP_LCD_DisplayStringAt(54 + Font16.Width , 10, (uint8_t*)"P1:SNK", LEFT_MODE);
    }
  }

#if (USBPD_PORT_COUNT > 1)
  if (portSel == 1)
  {
    BSP_LCD_SetBackColor(LCD_COLOR_ST_PINK);
    BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
  }
  else
  {
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
    BSP_LCD_SetTextColor(LCD_COLOR_ST_BLUE_DARK);
  }

  /* Port 1 */
  sprintf(pstr,"P2:SNK");
  BSP_LCD_DisplayStringAt(181 + Font16.Width, 10, (uint8_t*)pstr,LEFT_MODE);
#endif /* USBPD_PORT_COUNT > 1 */
}

/**
  * @brief  main demo function to manage all the appplication event and to update MMI
  * @param  Event Event value
  * @retval None
  */
static void DEMO_Manage_event(uint32_t Event)
{
  static DEMO_MENU _tab_menu_val[2] = { MENU_EMPTY, MENU_EMPTY};
  static uint8_t   _tab_connect_status[2] = { 0, 0};

  switch(Event & DEMO_MSG_TYPE_MSK)
  {
  case DEMO_MSG_MMI:
    {
      switch(Event & DEMO_MMI_ACTION_Msk)
      {
      case DEMO_MMI_ACTION_NONE:
        Display_power();
        return;
      case DEMO_MMI_ACTION_TAMPER_PRESS:   /* change the selected default port */
        portSel = !portSel;
        Display_menuupdate_info(portSel,_tab_menu_val[portSel]);
        break;
      case  DEMO_MMI_ACTION_RIGHT_PRESS:
        _tab_menu_val[portSel] = Menu_manage_next(portSel, _tab_menu_val[portSel]);
        Display_menuupdate_info(portSel,_tab_menu_val[portSel]);
        break;
      case  DEMO_MMI_ACTION_LEFT_PRESS:
        _tab_menu_val[portSel] = Menu_manage_prev(portSel, _tab_menu_val[portSel]);
        Display_menuupdate_info(portSel,_tab_menu_val[portSel]);
        break;
      case  DEMO_MMI_ACTION_UP_PRESS:       /* up /down */
        Display_menunav_info(portSel, _tab_menu_val[portSel], -1);
        break;
      case  DEMO_MMI_ACTION_DOWN_PRESS:
        Display_menunav_info(portSel, _tab_menu_val[portSel], +1);
        break;
      case DEMO_MMI_ACTION_SEL_PRESS :
        Display_menuexec_info(portSel, _tab_menu_val[portSel]);
        /* delay add to avoid multiple press event */
        osDelay(100);
        break;
      case DEMO_MMI_ACTION_HPD_DETECT_HIGH_PORT1 :
        Display_hpd(1, USBPD_TRUE);
        break;
      case DEMO_MMI_ACTION_HPD_DETECT_LOW_PORT1 :
        Display_hpd(1, USBPD_FALSE);
        break;
      case DEMO_MMI_ACTION_ERROR :
        DEMO_Display_Error(portSel);
        break;
      }
      joyevent = 0;
    }
    break;
  case DEMO_MSG_CAD :
    {
       uint8_t _portnum = (Event &  DEMO_CAD_PORT_NUM_Msk) >> DEMO_CAD_PORT_NUM_Pos;
       uint8_t _cc = (Event &  DEMO_CAD_CC_NUM_Msk) >> DEMO_CAD_CC_NUM_Pos;
       Display_cc_port(_portnum, (CCxPin_TypeDef)_cc);

       switch((Event & DEMO_CAD_STATE_Msk)>> DEMO_CAD_STATE_Pos)
       {
       case USBPD_CAD_EVENT_ATTEMC :
         _tab_connect_status[_portnum] = 1;
         Display_debug_port(_portnum, (uint8_t *)"attach emc");
         break;
       case USBPD_CAD_EVENT_ATTACHED :
         _tab_connect_status[_portnum] = 1;
         Display_debug_port(_portnum, (uint8_t *)"attach");
         break;
       case USBPD_CAD_EVENT_DETACHED :

         /* Reset cable information : vconn availble only for port 0 */
         if (_portnum == 0 )
         {
           pIdentity.CableVDO_Presence = 0;
         }

         _tab_connect_status[_portnum] = 0;
         _tab_menu_val[_portnum] = MENU_EMPTY;
         Display_contract_port(_portnum);
         Display_power();
         Display_debug_port(_portnum, (uint8_t *)"detach");
         if(portSel == _portnum) Display_menuupdate_info(_portnum, _tab_menu_val[_portnum]);
         break;
       }
    }
    break;
  case DEMO_MSG_PENOTIFY :
    {
      uint8_t _portnum = (Event &  DEMO_PE_PORT_NUM_Msk) >> DEMO_PE_PORT_NUM_Pos;

      switch((Event & DEMO_PE_STATE_Msk)>> DEMO_PE_STATE_Pos)
      {
      case USBPD_NOTIFY_POWER_EXPLICIT_CONTRACT :
        Display_Selected_port();
        Display_contract_port(_portnum);
        Display_power();
        Display_debug_port(_portnum, (uint8_t *)"Explicit contract");

        if (_tab_connect_status[_portnum] == 1)
        {
          if (DPM_Params[_portnum].PE_PowerRole == USBPD_PORTPOWERROLE_SNK)
            _tab_menu_val[_portnum] = MENU_SOURCECAPA_RECEIVED;
          else
            _tab_menu_val[_portnum] = MENU_COMMAND;

          if(_portnum == portSel)
          {
            Display_menuupdate_info(_portnum, _tab_menu_val[_portnum]);
          }

