STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Demonstrations/DemoUCPD/Src/demo_application.c
          _tab_connect_status[_portnum] = 2;
        }
        break;
      case USBPD_NOTIFY_HARDRESET_TX :
        Display_debug_port(_portnum, (uint8_t *)"send hardreset");
        break;
      case USBPD_NOTIFY_HARDRESET_RX :
        Display_debug_port(_portnum, (uint8_t *)"receive hardreset");
        break;
      case USBPD_NOTIFY_SNK_GOTOMIN :
        Display_debug_port(_portnum, (uint8_t *)"receive gotomin");
        break;
      case USBPD_NOTIFY_SNK_GOTOMIN_READY :
        Display_debug_port(_portnum, (uint8_t *)"receive gotomin ready");
        break;
      case USBPD_NOTIFY_SOFTRESET_RECEIVED :
        Display_debug_port(_portnum, (uint8_t *)"receive soft reset");
        break;
      case USBPD_NOTIFY_PING_RECEIVED :
        Display_debug_port(_portnum, (uint8_t *)"receive ping");
        break;
      case USBPD_NOTIFY_GETSRCCAP_ACCEPTED :
        Display_debug_port(_portnum, (uint8_t *)"receive source capa");
        break;
      case USBPD_NOTIFY_GETSRCCAP_REJECTED :
        Display_debug_port(_portnum, (uint8_t *)"reject source capa");
        break;
      case USBPD_NOTIFY_GETSNKCAP_TIMEOUT :
        Display_debug_port(_portnum, (uint8_t *)"timeout source capa");
        break;
      case USBPD_NOTIFY_REQUEST_ACCEPTED :
        Display_debug_port(_portnum, (uint8_t *)"request accepted");
        break;
      case USBPD_NOTIFY_REQUEST_REJECTED :
        Display_debug_port(_portnum, (uint8_t *)"request rejected");
        break;
      case USBPD_NOTIFY_REQUEST_WAIT :
        Display_debug_port(_portnum, (uint8_t *)"request wait");
        break;
      case USBPD_NOTIFY_REQUEST_GOTOMIN :
        Display_debug_port(_portnum, (uint8_t *)"request gotomin");
        break;
      case USBPD_NOTIFY_POWER_SWAP_TO_SNK_DONE :
        Display_debug_port(_portnum, (uint8_t *)"swap SNK done");
        break;
      case USBPD_NOTIFY_POWER_SWAP_TO_SRC_DONE :
        Display_debug_port(_portnum, (uint8_t *)"swap SRC done");
        break;
      case USBPD_NOTIFY_POWER_SWAP_REJ :
        Display_debug_port(_portnum, (uint8_t *)"power swap reject");
        break;
      case USBPD_NOTIFY_DATAROLESWAP_UFP:
      case USBPD_NOTIFY_DATAROLESWAP_DFP:
        Display_contract_port(_portnum);
      break;
      case USBPD_NOTIFY_REQUEST_ENTER_MODE :
        Display_debug_port(_portnum, (uint8_t *)"send vdm enter mode");
        break;
      case USBPD_NOTIFY_REQUEST_ENTER_MODE_ACK :
        Display_debug_port(_portnum, (uint8_t *)"vdm enter mode ACK");
        break;
      case USBPD_NOTIFY_REQUEST_ENTER_MODE_NAK :
        Display_debug_port(_portnum, (uint8_t *)"vdm enter mode NAK");
        break;
      case USBPD_NOTIFY_REQUEST_ENTER_MODE_BUSY :
        Display_debug_port(_portnum, (uint8_t *)"vdm enter mode BSY");
        break;
      }
    }
  break;

  }
  Display_Selected_port();

}

/**
  * @brief  demo task function
  * @param  queue_id ID of the queue
  * @retval None
  */
void DEMO_Task(void const *queue_id)
{
  osMessageQId  queue = *(osMessageQId *)queue_id;
  MUX_HPDStateTypeDef hpd_state      = HPD_STATE_LOW;
  if (MUX_OK != BSP_MUX_GetHPDState(TYPE_C_MUX_2, &hpd_state))
  {
    return;
  }

  if (HPD_STATE_HIGH == hpd_state)
  {
    DEMO_PostMMIMessage(DEMO_MMI_ACTION_HPD_DETECT_HIGH_PORT1);
  }
  else
  {
    DEMO_PostMMIMessage(DEMO_MMI_ACTION_HPD_DETECT_LOW_PORT1);
  }

  Display_build_info();

  for (;;)
  {
    osEvent event = osMessageGet(queue, 1000);
    DEMO_Manage_event(DEMO_MSG_MMI | DEMO_MMI_ACTION_NONE);
    if(osEventMessage == event.status)
    {
      DEMO_Manage_event(event.value.v);
    }
  }
}

/**
  * @brief  strin completion add space to fit the string size
  * @param  Str       Pointer on the string
  * @param  SizeMax   Max size of the string
  * @retval None
  */
static void string_completion(uint8_t *Str, uint8_t SizeMax)
{
  uint8_t size = strlen((char *)Str);

  if(size > SizeMax) Str[SizeMax] = '\0';
  else
  {
    /* add space */
    for(uint8_t index = size; index < SizeMax; index++)
    {
      Str[index] = ' ';
    }
    Str[SizeMax] = '\0';
  }
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
